CodenameNightwing/WebServices/WS especificos/Sabre/XMLSabreRQ/GetReservationRQ.xml

<soapenv:Envelope 
  xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:sec="http://schemas.xmlsoap.org/ws/2002/12/secext"
  xmlns:mes="http://www.ebxml.org/namespaces/messageHeader"
  xmlns:v1="http://webservices.sabre.com/pnrbuilder/v1_19"
  xmlns:v11="http://services.sabre.com/res/or/v1_14">
  <soapenv:Header>
    <sec:Security>
      <sec:BinarySecurityToken valueType="?" EncodingType="?">?</sec:BinarySecurityToken>
    </sec:Security>
    <mes:MessageHeader mes:id="?" mes:version="?">
      <mes:From>
        <mes:PartyId mes:type="?">?</mes:PartyId>
        <mes:Role>?</mes:Role>
      </mes:From>
      <mes:To>
        <mes:PartyId mes:type="?">?</mes:PartyId>
        <mes:Role>?</mes:Role>
      </mes:To>
      <mes:CPAId>AR</mes:CPAId>
      <mes:ConversationId>TestSuitARIT</mes:ConversationId>
      <mes:Service mes:type="?">GetReservationRQ</mes:Service>
      <mes:Action>GetReservationRQ</mes:Action>
      <mes:MessageData>
        <mes:MessageId>1</mes:MessageId>
        <mes:Timestamp>?</mes:Timestamp>
        <mes:RefToMessageId>?</mes:RefToMessageId>
        <mes:TimeToLive>?</mes:TimeToLive>
        <mes:Timeout>5</mes:Timeout>
      </mes:MessageData>
      <mes:DuplicateElimination>?</mes:DuplicateElimination>
      <mes:Description xml:lang="?">?</mes:Description>
    </mes:MessageHeader>
  </soapenv:Header>
  <soapenv:Body>
    <v1:GetReservationRQ Version="1.19.0">
      <v1:Locator>?</v1:Locator>
      <v1:RequestType>Stateful</v1:RequestType>
      <v1:ReturnOptions UnmaskCreditCard="true" ShowTicketStatus="false">
        <v1:SubjectAreas>
          <v1:SubjectArea>PRICING_INFORMATION</v1:SubjectArea>
        </v1:SubjectAreas>
        <v1:ViewName>Default</v1:ViewName>
        <v1:ResponseFormat>STL</v1:ResponseFormat>
      </v1:ReturnOptions>
    </v1:GetReservationRQ>
  </soapenv:Body>
</soapenv:Envelope>